/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_recursive_power.c                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jparteep <jparteep@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/05/17 21:56:24 by jparteep          #+#    #+#             */
/*   Updated: 2026/05/17 21:56:42 by jparteep         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// #include <stdio.h>

int	ft_recursive_power(int nb, int power)
{
	if (power < 0)
	{
		return (0);
	}
	if (power == 0)
	{
		return (1);
	}
	return (nb * ft_recursive_power(nb, power - 1));
}

// int main()
// {
//     printf("%d", ft_recursive_power(3, 5));
// }

// ตอนที่กล่องใบที่ 3 (ซึ่ง power = 1) กำลังถูกสต๊าฟรอไว้
// โค้ดในกล่องใบนั้นหน้าตาจริงๆ คือแบบนี้ครับ:
// return (3 * ft_recursive_power(3, 0)); มันรอผลลัพธ์ของก้อนหลังอยู่

// ทีนี้ พอไอ้เจ้าก้อนหลัง ft_recursive_power(3, 0)
// มันลงไปทำงานจนเจอ if (power == 0) แล้วมันโดนสั่งว่า return (1);
// คำว่า return แปลว่า "ให้ฟังก์ชันนี้ทั้งก้อน มีค่าเท่ากับสิ่งนี้"
// ดังนั้น ก้อน ft_recursive_power(3, 0) ทั้งก้อน จึงสลายร่างและ
// แปลงร่างเป็นเลข 1 ส่งกลับมาให้กล่องใบที่ 3 ครับ

// บรรทัดที่สต๊าฟรอไว้ จึงถูกแทนที่ (Substitute) ค่าลงไปแบบนี้:
// จาก: return (3 * ft_recursive_power(3, 0));
// กลายเป็น: return (3 * 1);

// พอคูณกันเสร็จ กล่องใบที่ 3 ก็จะ return (3);
// หรือก็คือแปลงร่างตัวเองทั้งก้อนกลายเป็นเลข 3
//ส่งกลับขึ้นไปให้กล่องใบที่ 2 ที่รออยู่:
// จาก: return (3 * ft_recursive_power(3, 1));
// กลายเป็น: return (3 * 3);