/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_recursive_factorial.c                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jparteep <jparteep@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/05/17 20:54:00 by jparteep          #+#    #+#             */
/*   Updated: 2026/05/28 19:22:06 by jparteep         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// #include <stdio.h>

int	ft_recursive_factorial(int nb)
{
	if (nb < 0)
	{
		return (0);
	}
	if (nb == 0)
	{
		return (1);
	}
	return (nb * ft_recursive_factorial(nb - 1));
}

// int main()
// {
//     printf(" 5! = %d\n", ft_recursive_factorial(5));
//     printf(" 0! = %d\n", ft_recursive_factorial(0));
//     printf("-3! = %d\n", ft_recursive_factorial(-3));
// }

//ขาขึ้น: ช่วง "เด้งกลับและคูณถอยหลัง" (Unwinding)
// พอชั้นล่างสุด (nb=0) ได้คำตอบแล้ว
//มันจะส่งค่ากลับขึ้นไปให้ชั้นที่รออยู่ด้านบนทีละชั้น
// (การคูณเกิดขึ้นในขั้นตอนนี้ครับ!)
// 1.ft_recursive_factorial(0) ส่งค่า 1 กลับไปให้คนที่เรียกมัน (คือชั้น nb=1)

// 2.ชั้น nb=1 ที่รออยู่ จะเอาค่าไปแทนในสมการที่ค้างไว้
// : return (1 * 1); -> ได้ผลลัพธ์เป็น 1 ส่งกลับขึ้นไป!

// 3.ชั้น nb=2 ที่รออยู่ จะเอามาคูณต่อ
// : return (2 * 1); -> ได้ผลลัพธ์เป็น 2 ส่งกลับขึ้นไป!

// 4.ชั้น nb=3: return (3 * 2); -> ได้ 6

// 5.ชั้น nb=4: return (4 * 6); -> ได้ 24

// 6.ชั้น nb=5 (ชั้นบนสุด): return (5 * 24); -> ได้ 120
// ส่งกลับไปที่ฟังก์ชัน main เพื่อ printf เป็นอันจบกระบวนการ!